"""А если дождь не идёт,
то нам все равно хотелось бы знать погоду.
Давайте добавим варианты погоды:
    Солнечно ли?
    Идёт ли снег?
    Сильный ветер?
    Облачно?

Давайте отразим это в коде!

Сегодня солнечно.
Сегодня идёт снег.
Сегодня сильный ветер.
Сегодня облачно.

"""


other_options = "О?"

if other_options == "Солнечно ли?":
    print("Сегодня солнечно.")
elif other_options == "Идёт ли снег?":
    print("Сегодня идёт снег.")
elif other_options == "Сильный ветер?":
    print("Сегодня сильный ветер.")
elif other_options == "Облачно?":
    print("Сегодня облачно.")
else:
    print('Ничего не подошло )))')
