"""Реализовать другие функции с помощью элементарных математических операций.
Например, максимум, в виде последовательности выражений,
в которых запрещены функции и сравнения:
print((a + b) / 2 + abs(a - b) / 2).

Почему это так?
https://docs.google.com/spreadsheets/d/1Gd5W36wdpNn6INjWWWHQJH0_MKIt5OV-qWW4tIqzo3I/edit?gid=0#gid=0
"""

a = 4
b = 2

print(...)
