x = -5
y = 4

# возвращает абсолютное значение числа.
print(abs(x))  # 5

# возводит число в указанную степень.
print(pow(x, y))  # 625
print(x ** y)  # 625

# округляет число до указанного количества десятичных знаков.
print(round(x / y, 2))  # -1.25
print(round(x / y, 0))  # -1.0
print(round(x / y))     # 1
print(round(500 / 4))

# возвращает наибольшее значение из указанных.
print(max(x, y))

# возвращает наименьшее значение из указанных.
print(min(x, y))

# возвращает сумму всех элементов в списке или кортеже чисел.
print(sum((x, y)))
