"""Напишите программу, которая запрашивает у пользователя вещественное число и выводит его представление в памяти
компьютера. Вещественные числа в памяти компьютера представлены с использованием формата с плавающей запятой.
Используйте стандартные функции языка Python для получения представления числа в бинарном виде и вывода его на экран.
"""

from convert_float_to_binary import convert_float_to_binary


print(convert_float_to_binary(44.102))
