"""Напишите программу, которая запрашивает у пользователя
год его рождения и выводит сообщение о том, к какому поколению он относится.
Поколения и их соответствующие годы рождения определены следующим образом:
==========================================================================
Поколение               Характеристика поколения
--------------------------------------------------------------------------
"Бэби-бумеры"           родившиеся до 1965 года включительно.
"X"                     родившиеся между 1966 и 1980 годами включительно.
"Y (миллениалы)"        родившиеся между 1981 и 1996 годами включительно.
"Z"                     родившиеся после 1996 года.
===========================================================================
Пример вывода:

Введите год вашего рождения: 1990
Вы относитесь к поколению: Y (миллениалы).

"""

generation = "Бэби-бумеры"

