"""Напишите программу, которая запрашивает у пользователя
положительное целое число и вычисляет его факториал.
Факториал числа N вычисляется как произведение всех целых чисел от 1 до N.
Используйте цикл с предусловием while для решения задачи.
Выведите результат на экран с помощью команды print.

Пример вывода:

Введите положительное целое число: 5
Факториал числа 5 равен 120
"""

num = int(input("Введите целое положительное число: "))

result = num
n = num
while ...:
    pass

print("Факториал числа", num, "равен", result)



